{
    "Muslim":"مسلم",
    "Tour In Muslim":"جولة في الإسلام",
    "At-Muslim & Islamic Center":"في المركز الإسلامي والمسلم",
    "A reliable Islamic Center to Follow the Qur'an & Sunnah":"مركز إسلامي موثوق يتبع القرآن والسنة",
    "The Salat is the time when the meeting with Allah and the ascension (Mi'raj) of the bliever takes place":"الصلاة هي الوقت الذي يحدث فيه اللقاء مع الله والمعراج للمؤمن",
    "Home":"الصفحه الرئسيه",
    "Fajr":"الفجر",
    "Dhuhr":"الضهر",
    "Asr":"العصر",
    "Maghrib":"المغرب",
    "Isha":"العشاء",
    "Prayer Times":"اوقات الصلاة",
    "Read Quran":"اقرء القرآن",
    "Read Hadiths":"اقرء الاحاديث",
    "Read Azkar":"اقرء الاذكار",
    "Read Tafsir":"اقرء التفسير",
    "About Us":"من نحن",
    "Salat Times":"مواعيد الصلاه",
    "Holy Quran":"القرآن الكريم",
    "Hadiths":"الاحاديث",
    "About Quran":"عن القرآن",
    "The Qur'an (القرآن) is the holy book of Islam, believed by Muslims to be the literal word of God (Allah) as revealed to the Prophet Muhammad (peace be upon him) over 23 years through the Angel Jibreel (Gabriel). It is written in Arabic and consists of 114 chapters, called Surahs, which vary in length. Each Surah is divided into verses called Ayat.Key Features of the Qur'an:Language: The Qur'an is in classical Arabic, known for its profound linguistic and literary qualities.Structure: It is not organized chronologically but rather by the length of the chapters, with longer ones typically appearing first.Themes:Monotheism (Tawhid): The oneness of God.Guidance: Rules and principles for personal conduct, social justice, and worship.Stories of Prophets: Accounts of earlier prophets like Noah, Abraham, Moses, and Jesus (peace be upon them).":"القرآن الكريم هو الكتاب المقدس في الإسلام، ويعتقد المسلمون أنه الكلمة الحرفية لله (الله) التي أوحيت إلى النبي محمد (صلى الله عليه وسلم) على مدار 23 عامًا عبر الملاك جبريل (عليه السلام). الكتاب مكتوب باللغة العربية ويتكون من 114 سورة، تتفاوت في الطول. كل سورة مقسمة إلى آيات.الميزات الرئيسية للقرآن الكريم:اللغة:القرآن مكتوب باللغة العربية الفصحى، التي تشتهر بخصائصها اللغوية والأدبية العميقة.الهيكل:القرآن لا يُنظم ترتيبًا زمنيًا، بل حسب طول السور. السور الأطول تأتي أولًا عادة، تليها السور الأقصر.المواضيع:التوحيد: الرسالة المركزية في القرآن هي وحدة الله.الهداية: يوفر القرآن قواعد ومبادئ للسلوك الشخصي، العدالة الاجتماعية، والعبادة.قصص الأنبياء: يحتوي على روايات عن الأنبياء السابقين مثل نوح، إبراهيم، موسى، وعيسى (عليهم السلام).الهداية الروحية والعملية:القرآن الكريم هو مرشد روحي شامل ويعد بمثابة قانون شامل للسلوك الشخصي والاجتماعي والأخلاقي. يغطي مجموعة واسعة من المواضيع، بدءًا من القوانين والأخلاق إلى التاريخ والهداية في التعاملات الإنسانية والممارسات الدينية.",
    "Azkar":"الاذكار",
    "About Hadiths":"عن الاحاديث",
    "About EL Azkar":"عن الاذكار",
    "About Tafsir":"عن التفسير",
    "Tafsir (تفسير) is the Arabic term for the interpretation or explanation of the Quran. It provides a detailed understanding of the meanings, context, and implications of Quranic verses. Tafsir is essential for Muslims to comprehend the Quran’s teachings and apply them to their lives accurately. Importance of Tafsir: Understanding the Quran: It explains the meanings of verses, particularly those that are complex or contain allegory. Contextual Insight: Tafsir clarifies the historical and cultural context of revelations (Asbab al-Nuzul). Practical Application: It provides guidance on how Quranic teachings relate to daily life, law, and ethics. Resolving Ambiguity: It resolves linguistic and interpretative ambiguities. Methodology of Tafsir: Quran Interprets Quran: Understanding a verse by referring to other related verses. Hadith: Using the sayings of the Prophet Muhammad to clarify meanings. Sayings of the Companions (Sahaba): Learning from the interpretations of those who lived with the Prophet. Arabic Language: Examining the linguistic structure and grammar. Context of Revelation (Asbab al-Nuzul): Analyzing historical circumstances of the verse's revelation.":"التفسير هو المصطلح العربي الذي يشير إلى تفسير أو شرح القرآن الكريم. يقدم التفسير فهماً مفصلاً لمعاني الآيات، وسياقها، وتداعياتها. يعتبر التفسير أساسياً للمسلمين لفهم تعاليم القرآن وتطبيقها بشكل صحيح في حياتهم. أهمية التفسير: فهم القرآن: يشرح معاني الآيات، خاصة تلك التي تكون معقدة أو تحتوي على تشبيه. رؤية سياقية: يوضح التفسير السياق التاريخي والثقافي للوحي (أسباب النزول). التطبيق العملي: يقدم التوجيه حول كيفية ارتباط تعاليم القرآن بالحياة اليومية، والقانون، والأخلاق. حل الالتباس: يحل التفسير الغموض اللغوي والتفسير. منهجية التفسير: القرآن يفسر القرآن: فهم الآية من خلال الرجوع إلى آيات أخرى ذات صلة. الحديث: استخدام أقوال النبي محمد صلى الله عليه وسلم لتوضيح المعاني. أقوال الصحابة: التعلم من تفسيرات من عاشوا مع النبي. اللغة العربية: فحص الهيكل اللغوي والنحوي. سياق الوحي (أسباب النزول): تحليل الظروف التاريخية لنزول الآية.",
    "A Hadith (plural: Ahadith) is a record of the sayings, actions, approvals, or attributes of the Prophet Muhammad (peace be upon him). Hadiths are an essential source of guidance for Muslims, second only to the Quran, and serve to explain and provide context to Quranic verses.Components of a Hadith:Isnad (Chain of Transmission):This refers to the chain of narrators who passed down the Hadith from the Prophet Muhammad (PBUH) to the compiler. The reliability of the chain is critical in determining the authenticity of the Hadith.Matn (Text of the Hadith):This is the actual content or text of the Hadith, which contains the sayings or actions of the Prophet (PBUH).Major Books of Hadith:Sahih al-Bukhari and Sahih Muslim: Considered the most authentic collections.Sunan Abu Dawood, Jami' at-Tirmidhi, Sunan an-Nasa'i, and Sunan Ibn Majah: Part of the Six Major Books of Hadith (Kutub al-Sittah).Musnad Ahmad ibn Hanbal: A comprehensive collection by Imam Ahmad.":"الحديث (جمع: أحاديث) هو سجل لأقوال وأفعال وموافقة وخصائص النبي محمد (صلى الله عليه وسلم). الأحاديث هي مصدر أساسي للهداية للمسلمين، تأتي في المرتبة الثانية بعد القرآن، وتخدم في تفسير وتوضيح آيات القرآن الكريم.مكونات الحديث:الإسناد (سلسلة الرواة):يشير إلى سلسلة الرواة الذين نقلوا الحديث من النبي محمد (صلى الله عليه وسلم) إلى المُجمِع. تعتبر مصداقية السلسلة أمرًا بالغ الأهمية في تحديد صحة الحديث.المتن (نص الحديث):هو المحتوى الفعلي أو نص الحديث، والذي يحتوي على أقوال أو أفعال النبي (صلى الله عليه وسلم).الكتب الرئيسية للحديث:صحيح البخاري وصحيح مسلم: يُعتبران من أكثر الكتب صحة.سنن أبي داود، جامع الترمذي، سنن النسائي، وسنن ابن ماجه: جزء من الكتب الستة الكبرى للحديث (الكتب الستة).مسند أحمد بن حنبل: مجموعة شاملة جمعها الإمام أحمد",
    "Azkar (أذكار) are a collection of supplications, praises, and remembrances of Allah (dhikr) recited by Muslims. These phrases and prayers hold significant spiritual value, helping Muslims maintain a connection with Allah throughout their daily lives. Azkar can be recited at specific times, such as in the morning and evening, or during particular situations, like before eating or sleeping. Importance of Azkar: Strengthening Faith: Remembrance of Allah helps deepen one’s faith and reliance on Him. Spiritual Protection: Many azkar serve as a shield against harm, evil, and temptations. Peace of Mind: Dhikr brings tranquility and comfort to the heart, as Allah says in the Quran: 'Indeed, in the remembrance of Allah do hearts find rest.'(Surah Ar-Ra'd, 13:28) Rewards and Blessings: Regular recitation of azkar brings immense rewards, as promised in the Quran and Sunnah. Types of Azkar: Morning and Evening Azkar (أذكار الصباح والمساء): These are recited after Fajr and Asr or Maghrib. Examples: “أعوذ بكلمات الله التامات من شر ما خلق” (I seek refuge in the perfect words of Allah from the evil of what He created.) “اللهم بك أصبحنا وبك أمسينا” (O Allah, by Your grace we have reached the morning and by Your grace, we reach the evening.) Azkar Before Sleeping: Includes reciting Ayat Al-Kursi, Surah Al-Ikhlas, Al-Falaq, and An-Nas, and other supplications like: “باسمك اللهم أموت وأحيا” (In Your name, O Allah, I die and I live.) Azkar for Specific Actions: Before Eating: “بسم الله” (In the name of Allah.) After Eating: “الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين” (Praise be to Allah who fed us, gave us drink, and made us Muslims.) Leaving the House: “بسم الله توكلت على الله ولا حول ولا قوة إلا بالله” (In the name of Allah, I place my trust in Allah, and there is no power or strength except by Allah.) General Azkar: SubhanAllah (Glory be to Allah). Alhamdulillah (Praise be to Allah). Allahu Akbar (Allah is the Greatest). La ilaha illallah (There is no deity but Allah). Benefits of Regular Azkar: Increased awareness and consciousness of Allah. Protection from the whispers of Shaytan. Purification of the soul. Increased gratitude and humility.":"الأذكار هي مجموعة من الأدعية والتسبيحات والذكر لله (الذِكر) التي يرددها المسلمون. تحمل هذه العبارات والدعوات قيمة روحية كبيرة، وتساعد المسلمين على الحفاظ على الاتصال بالله طوال حياتهم اليومية. يمكن تلاوة الأذكار في أوقات محددة، مثل الصباح والمساء، أو في مواقف معينة مثل قبل الأكل أو النوم. أهمية الأذكار: تعزيز الإيمان: ذكر الله يساعد في تعميق الإيمان والاعتماد عليه. الحماية الروحية: العديد من الأذكار تعمل كدرع ضد الأذى، والشر، والإغراءات. راحة البال: الذكر يجلب السكينة والراحة للقلب، كما قال الله في القرآن: لا بذكر الله تطمئن القلوب' (سورة الرعد، 13:28). الثواب والبركات: التلاوة المنتظمة للأذكار تجلب ثوابًا عظيمًا، كما وعد في القرآن والسنة. أنواع الأذكار: أذكار الصباح والمساء: تقال بعد الفجر والعصر أو المغرب. أمثلة: “أعوذ بكلمات الله التامات من شر ما خلق” “اللهم بك أصبحنا وبك أمسينا” الأذكار قبل النوم: تشمل تلاوة آية الكرسي، وسورة الإخلاص، والفلق، والناس، وأدعية أخرى مثل: “باسمك اللهم أموت وأحيا” الأذكار للأفعال المحددة: قبل الأكل: “بسم الله” بعد الأكل: “الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين” عند الخروج من المنزل: “بسم الله توكلت على الله ولا حول ولا قوة إلا بالله” الأذكار العامة: سبحان الله (سبحان الله). الحمد لله (الحمد لله). الله أكبر (الله أكبر). لا إله إلا الله (لا إله إلا الله). فوائد الأذكار المنتظمة: زيادة الوعي والاتصال بالله. الحماية من وساوس الشيطان. تطهير النفس. زيادة الشكر والتواضع."
}